# 알파벳 찾기

# 사이 갯수 구하는 공식 a ~ b => b - a + 1
# print(ord("z")- ord("a")+1) 총 26개

S = input()
arr = [-1] * 26

for i in range(0, len(S)):  # i --> 몇 번째 자리?
    # print(f"i = {i}")

    now = ord(S[i]) - 97  # ord("a") == 97 -> now : a의 index == 0
    # print(f"now = {now}")

    # 예외 처리에는 depth 주의
    if arr[now] != -1:
        # print("-1 이라 continue 됨")
        continue  # 밑의 흐름 끊고 바로 다음 반복 실행

    # 정상 흐름
    arr[now] = i
    # print(f"arr[{now}] = {i}")
    # print("="*50)


print(*arr, end=" ")
# log

# i = 0
# now = 1
# arr[1] = 0
# ==================================================
# i = 1
# now = 0
# arr[0] = 1
# ==================================================
# i = 2
# now = 4
# arr[4] = 2
# ==================================================
# i = 3
# now = 10
# arr[10] = 3
# ==================================================
# i = 4
# now = 9
# arr[9] = 4
# ==================================================
# i = 5
# now = 14
# arr[14] = 5
# ==================================================
# i = 6
# now = 14
# -1 이라 continue 됨
# i = 7
# now = 13
# arr[13] = 7
# ==================================================
